---
layout: post
status: publish
published: true
title: Nowi deweloperzy BSD w pierwszym kwartale 2015
author:
  display_name: kamil
  login: kamil
  email: krytarowski@gmail.com
  url: ''
author_login: kamil
author_email: krytarowski@gmail.com
excerpt: Typowym objawem żywotności projektu Open Source jest aktywność społeczności
  i rozw&oacute;j kodu źr&oacute;dłowego. W pierwszym kwartale bieżącego roku do grona
  programist&oacute;w w systemach BSD dołączyło już kilka os&oacute;b. Tak jak to
  w każdej wsp&oacute;lnocie ludzkiej bywa, ludzie przychodzą i odchodzą, jednakże
  nowi są znakiem, że projekt cieszy się niegasnącym zainteresowaniem nowych ludzi
  pragnących poświęcić sw&oacute;j czas na rzecz projektu.
wordpress_id: 281
wordpress_url: https://beastie.pl/?p=281
date: '2015-03-31 23:49:09 -0400'
date_gmt: '2015-03-31 21:49:09 -0400'
categories:
- Bez kategorii
tags:
- checkpoint
- netbsd
- freebsd
- dragonflybsd
comments: []
---
<p>Typowym objawem żywotności projektu Open Source jest aktywność społeczności i rozw&oacute;j kodu źr&oacute;dłowego. W pierwszym kwartale bieżącego roku do grona programist&oacute;w w systemach BSD dołączyło już kilka os&oacute;b. Tak jak to w każdej wsp&oacute;lnocie ludzkiej bywa, ludzie przychodzą i odchodzą, jednakże nowi są znakiem, że projekt cieszy się niegasnącym zainteresowaniem nowych ludzi pragnących poświęcić sw&oacute;j czas na rzecz projektu.<a id="more"></a><a id="more-281"></a></p>
<p><a href="http:&#47;&#47;beastie.pl&#47;wp-content&#47;uploads&#47;2015&#47;03&#47;freebsd.png"><img class="alignleft size-full wp-image-116" src="http:&#47;&#47;beastie.pl&#47;wp-content&#47;uploads&#47;2015&#47;03&#47;freebsd.png" alt="freebsd" width="200" height="200" &#47;><&#47;a>We <a href="https:&#47;&#47;www.freebsd.org&#47;news&#47;newsflash.html">FreeBSD<&#47;a> pięć os&oacute;b otrzymało prawa wprowadzania zmian w poszczeg&oacute;lnych repozytoriach projektu. 19 stycznia dołączył do grona deweloper&oacute;w <em>ports<&#47;em> (systemu oprogramowania zewnętrznego) Jan Beich (jbeich). W kolejnych miesiącach przystąpili do programist&oacute;w <em>src<&#47;em> (systemu bazowego): Wei Hu (whu) 11 lutego, Jason Harmening (jah) 8 marca, Eric van Gyzen (vangyzen) 8 marca i Kristof Provost (kp) 22 marca.</p>
<p><a href="http:&#47;&#47;beastie.pl&#47;wp-content&#47;uploads&#47;2015&#47;03&#47;NetBSD-smaller.png"><img class="alignright size-full wp-image-110" src="http:&#47;&#47;beastie.pl&#47;wp-content&#47;uploads&#47;2015&#47;03&#47;NetBSD-smaller.png" alt="NetBSD-smaller" width="200" height="200" &#47;><&#47;a> <a href="https:&#47;&#47;github.com&#47;IIJ-NetBSD&#47;netbsd-src&#47;commits&#47;master&#47;distrib&#47;notes&#47;common&#47;main">NetBSD<&#47;a> notuje trzech deweloper&oacute;w: Nilsa Ratusznik (nils) 6 stycznia, Kengo NAKAHARA (knakahara) 7 stycznia i Sevana Janiyan (sevan). Zgodnie z <a href="http:&#47;&#47;www.netbsd.org&#47;people&#47;developers.html">listą zainteresowań<&#47;a> Nils interesuje się tematyką pkgsrc i dokumentacją, a Sevan pkgsrc i zagadnieniami bezpieczeństwa w pkgsrc. <a href="http:&#47;&#47;2015.asiabsdcon.org&#47;timetable.html">Kengo<&#47;a> jest pracownikiem Internet Initiative Japan (IIJ) od 2013 r. i pracuje nad rozwiązaniami wykorzystującymi technologię NetBSD. Jednym z jego projekt&oacute;w jest implementacja MSI&#47;MSI-X i <em>interrupt affinity<&#47;em> dla architektury i386 i amd64.</p>
<p><a href="http:&#47;&#47;beastie.pl&#47;wp-content&#47;uploads&#47;2015&#47;03&#47;small_logo.png"><img class="alignleft size-full wp-image-119" src="http:&#47;&#47;beastie.pl&#47;wp-content&#47;uploads&#47;2015&#47;03&#47;small_logo.png" alt="small_logo" width="150" height="167" &#47;><&#47;a> <a href="https:&#47;&#47;www.dragonflydigest.com&#47;2015&#47;02&#47;13&#47;15608.html">DragonflyBSD<&#47;a> przyjęło Tomohiro Kusumi, kt&oacute;ry to 12 lutego wykonał sw&oacute;j <a href="http:&#47;&#47;gitweb.dragonflybsd.org&#47;dragonfly.git&#47;commitdiff&#47;ed71a58de0a8bc80a1ac9ade19721658a7583ed4">pierwszy commit<&#47;a>. Tomohiro pomagał rozwijać system plik&oacute;w Hammer podsyłając deweloperom łatki z poprawkami.</p>
