---
layout: post
status: publish
published: true
title: Zapiski NetBSD z AsiaBSDCon 2015
author:
  display_name: kamil
  login: kamil
  email: krytarowski@gmail.com
  url: ''
author_login: kamil
author_email: krytarowski@gmail.com
excerpt: Konferencja <a href="http:&#47;&#47;2015.asiabsdcon.org&#47;">AsiaBSDCon
  2015<&#47;a> odbyła się w dniach 12-15 marca w Tokyo w Japonii. W tym azjatyckim
  kraju znajduje się jedna z największych społeczności NetBSD na świecie -- dlaczego
  akurat tam? Trudno powiedzieć. Jednym z uczestnik&oacute;w i prelegent&oacute;w
  był <a href="https:&#47;&#47;twitter.com&#47;justincormack">Justin Cormack<&#47;a>
  (kt&oacute;ry przybył z Londynu w Wielkiej Brytanii), deweloper NetBSD i <a href="http:&#47;&#47;rumpkernel.org&#47;">rumpkernel<&#47;a>,
  kt&oacute;ry to zamieścił na <a href="https:&#47;&#47;blog.netbsd.org&#47;tnf&#47;entry&#47;asiabsdcon_2015">oficjalnym
  blogu Fundacji NetBSD<&#47;a> swoje zapiski z podr&oacute;ży.
wordpress_id: 293
wordpress_url: https://beastie.pl/?p=293
date: '2015-04-01 23:39:55 -0400'
date_gmt: '2015-04-01 21:39:55 -0400'
categories:
- Bez kategorii
tags:
- netbsd
- asiabsdcon
- japonia
- rumpkernel
comments: []
---
<p>Konferencja <a href="http:&#47;&#47;2015.asiabsdcon.org&#47;">AsiaBSDCon 2015<&#47;a> odbyła się w dniach 12-15 marca w Tokyo w Japonii. W tym azjatyckim kraju znajduje się jedna z największych społeczności NetBSD na świecie -- dlaczego akurat tam? Trudno powiedzieć. Jednym z uczestnik&oacute;w i prelegent&oacute;w był <a href="https:&#47;&#47;twitter.com&#47;justincormack">Justin Cormack<&#47;a> (kt&oacute;ry przybył z Londynu w Wielkiej Brytanii), deweloper NetBSD i <a href="http:&#47;&#47;rumpkernel.org&#47;">rumpkernel<&#47;a>, kt&oacute;ry to zamieścił na <a href="https:&#47;&#47;blog.netbsd.org&#47;tnf&#47;entry&#47;asiabsdcon_2015">oficjalnym blogu Fundacji NetBSD<&#47;a> swoje zapiski z podr&oacute;ży.<a id="more"></a><a id="more-293"></a></p>
<p>W piątek rano odbyło się zamknięte spotkanie deweloper&oacute;w NetBSD, a wieczorem tzw. sesja BoF (ang. <em>birds of a feather<&#47;em>) -- nieformalne spotkanie grupy os&oacute;b wsp&oacute;łdzielącej wsp&oacute;lne zainteresowanie, w tym wypadku rozw&oacute;j tego samego systemu operacyjnego. Jednym z zabierających głos był Kazuya Goda przyszły członek zespołu NetBSD, pracujący nad vxlan(4) z użyciem technologii rumpkernel. Taylor Campbell (riastradh) podzielił się statusem DRM&#47;KMS (sprzętową akceleracją grafiki) w 7.0 i wersji current. Makoto Fujiwara (mef) i Ryo Onodera (ryoon) rozmawiali o pkgsrc, m.in. o uproszczonym paczkowaniu oprogramowania z GitHuba. Jun Ebihara (jun) przybliżył zgromadzonym stan japońskiej społeczności użytkownik&oacute;w NetBSD, kt&oacute;ra to podr&oacute;żuje po całym kraju na konferencje poświęcone Wolnemu Oprogramowaniu, prezentując maszyny takie jak Raspberry Pi, Cubieboard, Zaurus, Jornada, Dramcast.</p>
<p>Wśr&oacute;d prelegent&oacute;w byli:</p>
<ul>
<li>Dennis Ferguson (dennis) z wykładem o modernizacji stosu sieciowego,<&#47;li>
<li>Ryota Ozaki (ozaki) opowiadający o pracy IIJ nad usprawnieniami w obsłudze kart sieciowych,<&#47;li>
<li>Martin Husemann (martin) m&oacute;wiący o sprzęcie ARM i trybie działania Big-Endian,<&#47;li>
<li>Taylor Campbell (riastradh) dzielący się wiedzą nt. kompilacji skrośnej pkgsrc,<&#47;li>
<li>Justin Cormack (justin) relacjonujący rozwiązanie rumpkernel w pisaniu i debugowaniu sterownik&oacute;w.<&#47;li><br />
<&#47;ul><br />
Nie należy zapominać o znakomitym jedzeniu i atmosferze rozm&oacute;w w rodzinie BSD. Do zobaczenia w przyszłym roku!</p>
